In [1]:
data = {'first': ["Lians", "Shem", "Zainab"],
        'last': ["Wanjiku", "Githinji", "Buno"],
        'email': ["lianswanjiku@gmail.com", "smaina@gmail.com", "zainab@gmail.com"]}

In [2]:
data

{'first': ['Lians', 'Shem', 'Zainab'],
 'last': ['Wanjiku', 'Githinji', 'Buno'],
 'email': ['lianswanjiku@gmail.com', 'smaina@gmail.com', 'zainab@gmail.com']}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(data)

In [5]:
df

    first      last                   email
0   Lians   Wanjiku  lianswanjiku@gmail.com
1    Shem  Githinji        smaina@gmail.com
2  Zainab      Buno        zainab@gmail.com

In [8]:
#Let's start by combining rows and columns
df['full_name'] = df['first'] + ' ' + df['last']

In [9]:
df

    first      last                   email      full_name
0   Lians   Wanjiku  lianswanjiku@gmail.com  Lians Wanjiku
1    Shem  Githinji        smaina@gmail.com  Shem Githinji
2  Zainab      Buno        zainab@gmail.com    Zainab Buno

In [11]:
#let's try to remove a bunch of columns from the dataFrame
df.drop(columns = ['first', 'last'], inplace =True)

In [12]:
df

                    email      full_name
0  lianswanjiku@gmail.com  Lians Wanjiku
1        smaina@gmail.com  Shem Githinji
2        zainab@gmail.com    Zainab Buno

In [13]:
#Let's split the data frame
df['full_name'].str.split(" ",expand = True)

        0         1
0   Lians   Wanjiku
1    Shem  Githinji
2  Zainab      Buno

In [15]:
df[['first', 'last']] = df['full_name'].str.split(" ",expand = True)
df

                    email      full_name   first      last
0  lianswanjiku@gmail.com  Lians Wanjiku   Lians   Wanjiku
1        smaina@gmail.com  Shem Githinji    Shem  Githinji
2        zainab@gmail.com    Zainab Buno  Zainab      Buno

In [17]:
#We can add new elements to the dataframe using the append function
df.append({'first': 'Tony'}, ignore_index = True)

                    email      full_name   first      last
0  lianswanjiku@gmail.com  Lians Wanjiku   Lians   Wanjiku
1        smaina@gmail.com  Shem Githinji    Shem  Githinji
2        zainab@gmail.com    Zainab Buno  Zainab      Buno
3                     NaN            NaN    Tony       NaN

In [20]:
people = {'first': ["Stella", "Natalie"],
        'last': ["Smith", "Mikaelson"],
        'email': ["stelasmith@gmail.com", "mnatalie@gmail.com"]}
df1 = pd.DataFrame(people)
df1

     first       last                 email
0   Stella      Smith  stelasmith@gmail.com
1  Natalie  Mikaelson    mnatalie@gmail.com

#Combining two DataFrames to become one

In [22]:
df.append(df1, ignore_index = True)

                    email      full_name    first       last
0  lianswanjiku@gmail.com  Lians Wanjiku    Lians    Wanjiku
1        smaina@gmail.com  Shem Githinji     Shem   Githinji
2        zainab@gmail.com    Zainab Buno   Zainab       Buno
3    stelasmith@gmail.com            NaN   Stella      Smith
4      mnatalie@gmail.com            NaN  Natalie  Mikaelson

In [25]:
df

                    email      full_name   first      last
0  lianswanjiku@gmail.com  Lians Wanjiku   Lians   Wanjiku
1        smaina@gmail.com  Shem Githinji    Shem  Githinji
2        zainab@gmail.com    Zainab Buno  Zainab      Buno